#ifndef _ADT7420_H_
#define _ADT7420_H_


#include "i2c.h"
#include "main.h"

//******************************************************************************
//Параметры ADT7420
//******************************************************************************

//I2C-адрес микросхемы
#define ADT7420_SLAVE_ADDR       I2C_ADT7420_ADDR

//******************************************************************************
//Адреса регистров ADT7420
//******************************************************************************
typedef enum {
  ADT7420_MOST_SIGNIFICANT_BYTE = 0x00,
  ADT7420_LEAT_SIGNIFICANT_BYTE,
  ADT7420_STATUS,
  ADT7420_CONFIGURATION,
  ADT7420_T_HIGH_M,
  ADT7420_T_HIGH_L,
  ADT7420_T_LOW_M,
  ADT7420_T_LOW_L,
  ADT7420_T_CRIT_M,
  ADT7420_T_CRIT_L,
  ADT7420_T_HYST,
  ADT7420_ID,
} t_adt7420_reg;  

//******************************************************************************
//Результат выполнения операции с ADT7420
//******************************************************************************
typedef enum {
    ADT7420_SUCCESS = 0,
    ADT7420_TIMEOUT,
    ADT7420_ERROR
} t_adt7420_status;

//******************************************************************************
// Прототипы функций
//******************************************************************************
extern t_adt7420_status adt7420_init();
extern t_adt7420_status adt7420_get_temperature(int16_t* value);

//******************************************************************************
// Макросы
//******************************************************************************


#endif