#ifndef _ADT7420_H_
#define _ADT7420_H_

#include <stdint.h>

#include "i2c.h"
#include "main.h"


//******************************************************************************
//Параметры ADT7420
//******************************************************************************

//I2C-адрес микросхемы
#define ADT7420_SLAVE_ADDR I2C_ADT7420_ADDR
// Ошибка чтения
#define ADT7420_ERROR_RESP -1

//******************************************************************************
//Адреса регистров ADT7420
//******************************************************************************
typedef enum {
  ADT7420_MOST_SIGNIFICANT_BYTE = 0x00,
  ADT7420_LEAT_SIGNIFICANT_BYTE,
  ADT7420_STATUS,
  ADT7420_CONFIGURATION,
  ADT7420_T_HIGH_M,
  ADT7420_T_HIGH_L,
  ADT7420_T_LOW_M,
  ADT7420_T_LOW_L,
  ADT7420_T_CRIT_M,
  ADT7420_T_CRIT_L,
  ADT7420_T_HYST,
  ADT7420_ID,
} t_adt7420_reg;

//******************************************************************************
// Прототипы функций
//******************************************************************************
void adt7420_proccess();
t_i2c_status adt7420_init();
t_i2c_status adt7420_get_temperature(int16_t* value);
t_i2c_status adt7420_available();

//******************************************************************************
// Макросы
//******************************************************************************


#endif